app/controllers/holidays_controller.rb

SELECT `holidays`.* FROM `holidays`
---
  def index
    @holidays = Holiday.all

SELECT `holidays`.* FROM `holidays` WHERE `holidays`.`id` = 1 LIMIT 1
---
  def show
    @holiday = Holiday.find(params[:id])

SELECT `holidays`.* FROM `holidays` WHERE `holidays`.`id` = 1 LIMIT 1
---
  def edit
    @holiday = Holiday.find(params[:id])

INSERT INTO `holidays` (`updated_at`, `holiday_date`, `created_at`, `descr`) VALUES ('2011-06-11 04:39:17', '2011-06-11', '2011-06-11 04:39:17', 'Random Holiday')
---
  def create
    @holiday = Holiday.new(params[:holiday])

    respond_to do |format|
      if @holiday.save

SELECT `holidays`.* FROM `holidays` WHERE `holidays`.`id` = 1 LIMIT 1
UPDATE `holidays` SET `descr` = 'Random Holiday', `updated_at` = '2011-06-11 04:24:08' WHERE `holidays`.`id` = 1
---
  def update
    @holiday = Holiday.find(params[:id])

    respond_to do |format|
      if @holiday.update_attributes(params[:holiday])

SELECT `holiday`.* FROM `holiday` WHERE `holiday`.`id` = 0 LIMIT 1
DELETE FROM `holiday` WHERE `holiday`.`id` = 0
---
  def destroy
    @holiday = Holiday.find(params[:id])
    @holiday.destroy