app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def new
    @project = Project.new
    @allWorkitems = Workitem.all
    @allTeams = Team.all
---
SELECT `workitems`.* FROM `workitems`
SELECT `team`.* FROM `team`

  def edit
    @project = Project.find(params[:id])
    # Workitem
    @allWorkitems = Workitem.all
    @projectWorkitems = @project.workitems
    # Team
    @allTeams = Team.all
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `workitems`.* FROM `workitems`
SELECT `team`.* FROM `team`

  def create
    @project = Project.new(params[:project])

    # Set associate workitems.
    _project_workitems = params[:selected_project_workitems]

    @project.workitem_ids = (_project_workitems.nil?)?nil:_project_workitems.map {|id_str| id_str.to_i}

    # Set associate teams.
    _project_teams = params[:selected_project_teams]

    @project.team_ids = (_project_teams.nil?)?nil:_project_teams.map {|id_str| id_str.to_i}

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `updated_at`, `created_at`) VALUES ('project1', '2011-06-06 10:33:40', '2011-06-06 10:33:40')
INSERT INTO `task_workitem` (`task_id`, `workitem_id`) VALUES (2, 2)

  def update
    @project = Project.find(params[:id])

    # Set associate workitems.
    _project_workitems = params[:selected_project_workitems]

    @project.workitem_ids = (_project_workitems.nil?)?nil:_project_workitems.map {|id_str| id_str.to_i}

    # Set associate teams.
    _project_teams = params[:selected_project_teams]

    @project.team_ids = (_project_teams.nil?)?nil:_project_teams.map {|id_str| id_str.to_i}

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT * FROM `workitems` INNER JOIN `project_workitem` ON `workitems`.id = `project_workitem`.workitem_id WHERE (`project_workitem`.project_id = 1 )
SELECT * FROM `team` INNER JOIN `team_task` ON `team`.id = `team_task`.team_id WHERE (`team_task`.task_id = 1 )
UPDATE `projects` SET `updated_at` = '2011-06-06 10:44:42', `name` = '项目二' WHERE `projects`.`id` = 2