app/controllers/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1

  def new
    @team = Team.new
    @userAll = User.all
---
SELECT `users`.* FROM `users`

  def edit
    @team = Team.find(params[:id])
    # User
    @userAll = User.all
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users`

  def create
    @team = Team.new(params[:team])

    _team_users = params[:selected_team_users]

    @team.user_ids = (_team_users.nil?)?nil:_team_users.map {|id_str| id_str.to_i}

    _team_projects = params[:selected_team_projects]

    @team.project_ids = (_team_projects.nil?)?nil:_team_projects.map {|id_str| id_str.to_i}

    respond_to do |format|
      if @team.save
---
INSERT INTO `team_user` (`user_id`, `team_id`) VALUES (1, 2)
INSERT INTO `teams` (`name`, `updated_at`, `created_at`) VALUES ('team3', '2011-06-09 14:11:57', '2011-06-09 14:11:57')

  def update
    @team = Team.find(params[:id])

    _team_users = params[:selected_team_users]

    @team.user_ids = (_team_users.nil?)?nil:_team_users.map {|id_str| id_str.to_i}

    _team_projects = params[:selected_team_projects]

    @team.project_ids = (_team_projects.nil?)?nil:_team_projects.map {|id_str| id_str.to_i}

    respond_to do |format|
      if @team.update_attributes(params[:team])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
SELECT * FROM `users` INNER JOIN `team_user` ON `users`.id = `team_user`.user_id WHERE (`team_user`.team_id = 1 )
UPDATE `teams` SET `name` = 'Team11', `updated_at` = '2011-06-05 08:48:21' WHERE `teams`.`id` = 1

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 2 LIMIT 1
DELETE FROM `teams` WHERE `teams`.`id` = 2

  def statistics

    @team = Team.find(params[:id])
---
SELECT `team`.* FROM `team` WHERE `team`.`id` = 1 LIMIT 1