app/controllers/users_controller.rb

  def statistics

    @user_id
    @user
    @allUsers = User.order('login')
---
SELECT `user`.* FROM `user` WHERE `user`.`login` = 'user1' LIMIT 1