app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` WHERE `users`.`login` = 'user1' LIMIT 1
---
  def index
    # @users = User.all
    # @users = User.paginate :page => params[:page], :order => 'created_at DESC'
    @users = User.paginate :page => params[:page], :order => 'login ASC', :per_page => 10

SELECT `teams`.* FROM `teams`
---
  def new
    @user = User.new
    @allTeams = Team.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `teams`.* FROM `teams`
---
  def edit
    @user = User.find(params[:id])
    @allTeams = Team.all

INSERT INTO `team_user` (`user_id`, `team_id`) VALUES (3, 1)
INSERT INTO `user` (`email`, `updated_at`, `team_id`, `roles`, `crypted_password`, `created_at`, `name`, `login`) VALUES ('user2@a.com', '2011-08-02 05:23:11', NULL, 'admin,user,manager,reporter', '7e58d63b60197ceb55a1c487989a3720', '2011-08-02 05:23:11', NULL, 'user2')
---
  def create
    @user = User.new(params[:user])

    # Encrypt password.
    _password = params[:user][:password]
    @user.crypted_password = encrypt_password(_password)

    _user_teams = params[:selected_user_teams]

    @user.team_ids = (_user_teams.nil?)?nil:_user_teams.map {|id_str| id_str.to_i}

    # Extract selected user roles information.
    _user_roles = params[:selected_user_roles]
    _user_roles_str = nil
    _user_roles_str = _user_roles.join(',') if (!_user_roles.nil?)
    @user.roles = _user_roles_str

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT * FROM `teams` INNER JOIN `team_user` ON `teams`.id = `team_user`.team_id WHERE (`team_user`.user_id = 2 )
UPDATE `users` SET `updated_at` = '2011-06-11 05:59:50', `crypted_password` = 'c4ca4238a0b923820dcc509a6f75849b' WHERE `users`.`id` = 5
---
  def update
    @user = User.find(params[:id])
    _oldPassword = @user.crypted_password

    # Encrypt user password.
    _password = params[:user][:password]
    if ((_password.nil?) or (_password == ''))
      @user.crypted_password = _oldPassword
    else
      @user.crypted_password = encrypt_password(_password)
    end

    _user_teams = params[:selected_user_teams]
    @user.team_ids = (_user_teams.nil?)?nil:_user_teams.map {|id_str| id_str.to_i}

    # Extract selected user roles information.
    _user_roles = params[:selected_user_roles]
    _user_roles_str = nil
    _user_roles_str = _user_roles.join(',') if (!_user_roles.nil?)
    @user.roles = _user_roles_str

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `user`.* FROM `user` WHERE `user`.`id` = 2 LIMIT 1
SELECT report.hours, task.name as task_name, workitem.name as workitem_name, report.date, report.description FROM `report` INNER JOIN `user` ON `user`.`id` = `report`.`user_id` INNER JOIN `task` ON `task`.`id` = `report`.`task_id` INNER JOIN `workitem` ON `workitem`.`id` = `report`.`workitem_id` WHERE `report`.`user_id` = 1 AND (`report`.`date` BETWEEN '2011-08-08' AND '2011-08-08') ORDER BY date, task_id, workitem_id
SELECT sum(hours) as hours, task.name as task_name, workitem.name as workitem_name FROM `report` INNER JOIN `user` ON `user`.`id` = `report`.`user_id` INNER JOIN `task` ON `task`.`id` = `report`.`task_id` INNER JOIN `workitem` ON `workitem`.`id` = `report`.`workitem_id` WHERE `report`.`user_id` = 2 AND (`report`.`date` BETWEEN '2011-07-15' AND '2011-06-14') GROUP BY task_id, workitem_id, task_name, workitem_name ORDER BY task_id, workitem_id
---
  def statistics
    @user = User.find(params[:id])
    @start_date
    @end_date
    @users

    _stat_date = params[:stat_date]
    unless _stat_date.nil?
      @start_date = Date.new(_stat_date["start(1i)"].to_i, _stat_date["start(2i)"].to_i, _stat_date["start(3i)"].to_i)
      @end_date = Date.new(_stat_date["end(1i)"].to_i, _stat_date["end(2i)"].to_i, _stat_date["end(3i)"].to_i)

      @reports = Report.select("sum(hours) as hours, task.name as task_name, workitem.name as workitem_name") \
        .joins(:user, :project, :workitem) \
        .where("report.date" => @start_date..@end_date, "report.user_id" => @user.id)\
        .group("task_id, workitem_id, task_name, workitem_name") \
        .order("task_id, workitem_id") \
        .all