app/controllers/workitems_controller.rb

SELECT `workitems`.* FROM `workitems`
---
  def index
    @workitems = Workitem.all

SELECT `workitems`.* FROM `workitems` WHERE `workitems`.`id` = 1 LIMIT 1
---
  def show
    @workitem = Workitem.find(params[:id])

SELECT `projects`.* FROM `projects`
---
  def new
    @workitem = Workitem.new
    @allProjects = Project.all

SELECT `workitems`.* FROM `workitems` WHERE `workitems`.`id` = 2 LIMIT 1
SELECT `projects`.* FROM `projects`
---
  def edit
    @workitem = Workitem.find(params[:id])
    @allProjects = Project.all

INSERT INTO `task_workitem` (`workitem_id`, `task_id`) VALUES (1, 2)
INSERT INTO `workitem` (`name`, `created_at`, `descr`, `updated_at`) VALUES ('workitem12', '2011-07-02 13:44:13', NULL, '2011-07-02 13:44:13')
---
  def create
    @workitem = Workitem.new(params[:workitem])

    _workitem_projects = params[:selected_workitem_projects]

    @workitem.project_ids = (_workitem_projects.nil?)?nil:_workitem_projects.map {|id_str| id_str.to_i}

    respond_to do |format|
      if @workitem.save

SELECT `workitems`.* FROM `workitems` WHERE `workitems`.`id` = 2 LIMIT 1
SELECT * FROM `projects` INNER JOIN `project_workitem` ON `projects`.id = `project_workitem`.project_id WHERE (`project_workitem`.workitem_id = 2 )
UPDATE `workitem` SET `updated_at` = '2011-07-02 13:43:54', `name` = 'workitem11' WHERE `workitem`.`id` = 1
---
  def update
    @workitem = Workitem.find(params[:id])

    _workitem_projects = params[:selected_workitem_projects]

    @workitem.project_ids = (_workitem_projects.nil?)?nil:_workitem_projects.map {|id_str| id_str.to_i}

    respond_to do |format|
      if @workitem.update_attributes(params[:workitem])