app/controllers/worklogs_controller.rb

SELECT `user`.* FROM `user` WHERE `user`.`login` = 'admin' LIMIT 1
SELECT `report`.* FROM `report` WHERE (user_id = 1) ORDER BY date ASC LIMIT 20 OFFSET 0
SELECT `user`.* FROM `user` ORDER BY login ASC LIMIT 20 OFFSET 0
---
  def index
    # Find login user.
    @user = User.find_by_login(@current_login)

    @worklogs = Report.paginate :page => params[:page], :conditions => ["user_id = ?", @user.id], :order => 'date ASC', :per_page => 20

SELECT `user`.* FROM `user` WHERE `user`.`login` = 'user1' LIMIT 1
SELECT `report`.* FROM `report` WHERE `report`.`id` = 1 AND `report`.`user_id` = 1 LIMIT 1
---
  def show
    # Authentication
    include ModuleDbAuthenticate
    before_filter :authenticate

    # Find login user.
    @user = User.find_by_login(@current_login)

    @worklog = Report.find_by_id_and_user_id(params[:id], @user.id)

SELECT `user`.* FROM `user` WHERE `user`.`login` = 'user1' LIMIT 1
---
  def new
    # Find login user.
    @user = User.find_by_login(@current_login)

SELECT `user`.* FROM `user` WHERE `user`.`login` = 'user1' LIMIT 1
SELECT `report`.* FROM `report` WHERE `report`.`id` = 1 AND `report`.`user_id` = 1 LIMIT 1
---
  def edit
    # Find login user.
    @user = User.find_by_login(@current_login)

    @worklog =Report.find_by_id_and_user_id(params[:id], @user.id)